<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"7969c9ae6bbacf9023cc781386fdb0ab2e7066fdbd80dbb2b62d1e63cecccbf0","plan_job_ref":"Job Terraform Plan #93 at https://github.com/ironashram/kub1k/actions/runs/11534342731","plan_out_hash":"c18c5639bda7ed47061b6b3bb30405fa267a61c2dc529717e74a3e09adfbfd76","plan_hash":"38b53a0606f2aa22868392134fd16c73f562b3e755257dcf9bca5d517f5564c2","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.ingress_nginx will be updated in-place
!~  resource "helm_release" "ingress_nginx" {
        id                         = "ingress-nginx"
        name                       = "ingress-nginx"
!~      version                    = "4.11.3" -> "4.12.0-beta.0"
#        (27 unchanged attributes hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-10-25T21:59:21Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #93](https://github.com/ironashram/kub1k/actions/runs/11534342731)